tutorials/immersedBoundary/cylinderInChannelScalarTransport/0_org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 0 0 1 0 0];

internalField uniform 0;

boundaryField
{
    ibCylinder
    {
        type mixedIb;
        patchType immersedBoundary;
        triValue uniform 0;
        triGradient  uniform 0;
        triValueFraction uniform 0;
        value uniform 0;

        setDeadValue   no;
        deadValue      0;
    }
    in
    {
        type fixedValue;
        value uniform 1;
    }
    out
    {
        type zeroGradient;
    }

    top
    {
        type fixedValue;
        value uniform 0;
    }

    bottom
    {
        type fixedValue;
        value uniform 0;
    }

    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
